In [ ]:
name="Vikram Singh"

In [ ]:
import pandas

In [ ]:
housing=pandas.read_excel("https://github.com/SavioSal/datasets/raw/master/Housing%20Regressions%20Simple.xlsx")

In [ ]:
housing

     House  Appraised Value  Selling Price  Square Feet  Bedrooms  Bathrooms
0        1         119370.0       121870.0       2050.0         4          5
1        2         148930.0       150250.0       2200.0         4          4
2        3         130390.0       122780.0       1590.0         3          3
3        4         135700.0       144350.0       1860.0         3          3
4        5         126300.0       116200.0       1210.0         2          3
..     ...              ...            ...          ...       ...        ...
143    144         125180.0       124710.0       1660.0         3          4
144    145         157510.0       148650.0       2110.0         4          5
145    146         126670.0       128520.0       1430.0         2          2
146    147         137570.0       132020.0       1710.0         4          5
147    148         133460.0       128030.0       1580.0         2          1

[148 rows x 6 columns]

In [ ]:
housing.head()

   House  Appraised Value  Selling Price  Square Feet  Bedrooms  Bathrooms
0      1         119370.0       121870.0       2050.0         4          5
1      2         148930.0       150250.0       2200.0         4          4
2      3         130390.0       122780.0       1590.0         3          3
3      4         135700.0       144350.0       1860.0         3          3
4      5         126300.0       116200.0       1210.0         2          3

In [ ]:
housing.tail()

     House  Appraised Value  Selling Price  Square Feet  Bedrooms  Bathrooms
143    144         125180.0       124710.0       1660.0         3          4
144    145         157510.0       148650.0       2110.0         4          5
145    146         126670.0       128520.0       1430.0         2          2
146    147         137570.0       132020.0       1710.0         4          5
147    148         133460.0       128030.0       1580.0         2          1

In [ ]:
y=housing[["Selling Price"]]

In [ ]:
x=housing[["Bedrooms","Bathrooms","Appraised Value","Square Feet"]]
#pandas has two types of data structure;series and date frames
#series is one dimentional structure and data frames are two dimentional structures

In [ ]:
y.head()

   Selling Price
0       121870.0
1       150250.0
2       122780.0
3       144350.0
4       116200.0

In [ ]:
x.head()

   Bedrooms  Bathrooms  Appraised Value  Square Feet
0         4          5         119370.0       2050.0
1         4          4         148930.0       2200.0
2         3          3         130390.0       1590.0
3         3          3         135700.0       1860.0
4         2          3         126300.0       1210.0

In [ ]:
housing.drop(columns=["House","Selling Price"])

     Appraised Value  Square Feet  Bedrooms  Bathrooms
0           119370.0       2050.0         4          5
1           148930.0       2200.0         4          4
2           130390.0       1590.0         3          3
3           135700.0       1860.0         3          3
4           126300.0       1210.0         2          3
..               ...          ...       ...        ...
143         125180.0       1660.0         3          4
144         157510.0       2110.0         4          5
145         126670.0       1430.0         2          2
146         137570.0       1710.0         4          5
147         133460.0       1580.0         2          1

[148 rows x 4 columns]

In [ ]:
#linear regression algorithm
#sklearn for Analytics and Machine Learning
from sklearn import linear_model

In [ ]:
#for cross validation
from sklearn.model_selection import train_test_split

In [ ]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,train_size=0.7,random_state=42)

In [ ]:
x_train.head()

     Bedrooms  Bathrooms  Appraised Value  Square Feet
93          2          3         105060.0       1540.0
141         5          6         167730.0       2510.0
108         2          2         121590.0       1410.0
0           4          5         119370.0       2050.0
73          2          2         129910.0       1610.0

In [ ]:
len(x_train)

103

In [ ]:
len(y_train)

103

In [ ]:
  #linear regression
  l_reg=linear_model.LinearRegression()

In [ ]:
#
l_reg_model=l_reg.fit(x_train,y_train)

In [ ]:
#values of m1, m2,m3,m4
l_reg_model.coef_
#bedroomis reducing(-), bathroom, appraisal & sq feet are increasing (+)

array([[-1.34098206e+03,  3.45862043e+02,  6.91105589e-01,
         2.28459563e+01]])

In [ ]:
#value of c
l_reg_model.intercept_

array([4817.35261319])

In [ ]:
l_reg_model.predict([[5,5,100000,2000]])

/usr/local/lib/python3.7/dist-packages/sklearn/base.py:446: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  "X does not have valid feature names, but"

array([[114644.2240178]])